package com.zom.keep.tech.script.yun3;

import org.springframework.util.StringUtils;

public class BEACON_PARTLY_INSERT {

    public static void main(String[] args) {
        generateInsertSQL();
    }

    public static void generateInsertSQL() {
        StringBuilder sb = new StringBuilder(1000);
        String sql_base = "INSERT INTO `rtv_beacon`(`beaconNo`, `bind_loc_id`, `start_time`, `work_status`, `change_battery_time`, `battery_info`, `update_time`, `power_status`, `mac_addres`, `name`) " +
                "VALUES ";
        sb.append(sql_base);

        //
        // ('27', '8', '2019-01-10 00:00:00', 0, '2019-03-10 00:00:00', NULL, '2019-02-17 15:18:26', 100, 'A0:E6:F8:25:D7:91', '积水潭51');
        //('8986043201187962500', '1', 1, '2019-02-28 15:14:00', 0, '', NULL, 3, 0, 0),;";

        String[] data = {
                "A0:E6:F8:25:01:E5,126,珠市口8S-1",
                "A0:E6:F8:25:01:5A,126,珠市口8S-2",
                "A0:E6:F8:25:00:70,126,珠市口8S-3",
                "A0:E6:F8:25:00:43,126,珠市口8S-4",
                "A0:E6:F8:25:00:71,126,珠市口8S-5",
                "A0:E6:F8:25:00:72,126,珠市口8S-6",
                "A0:E6:F8:25:00:75,126,珠市口8S-7",
                "A0:E6:F8:25:00:76,126,珠市口8S-8",
                "A0:E6:F8:25:00:7B,127,天桥8S-9",
                "A0:E6:F8:25:00:79,127,天桥8S-10",
                "A0:E6:F8:25:00:78,127,天桥8S-11",
                "A0:E6:F8:25:00:7A,127,天桥8S-12",
                "A0:E6:F8:25:00:7C,127,天桥8S-13",
                "A0:E6:F8:25:01:E7,127,天桥8S-14",
                "A0:E6:F8:25:00:60,127,天桥8S-15",
                "A0:E6:F8:25:00:5E,127,天桥8S-16",
                "A0:E6:F8:25:00:5F,128,永定门外8S-17",
                "A0:E6:F8:25:00:66,128,永定门外8S-18",
                "A0:E6:F8:25:00:68,128,永定门外8S-19",
                "A0:E6:F8:25:00:6A,128,永定门外8S-20",
                "A0:E6:F8:25:00:65,128,永定门外8S-21",
                "A0:E6:F8:25:00:63,128,永定门外8S-22",
                "A0:E6:F8:25:00:61,128,永定门外8S-23",
                "A0:E6:F8:25:00:6C,128,永定门外8S-24",
                "A0:E6:F8:25:00:64,129,木樨园8S-25",
                "A0:E6:F8:25:00:62,129,木樨园8S-26",
                "A0:E6:F8:25:00:67,129,木樨园8S-27",
                "A0:E6:F8:25:01:E6,129,木樨园8S-28",
                "A0:E6:F8:25:00:53,129,木樨园8S-29",
                "A0:E6:F8:25:00:52,129,木樨园8S-30",
                "A0:E6:F8:25:00:50,129,木樨园8S-31",
                "A0:E6:F8:25:00:51,129,木樨园8S-32",
                "A0:E6:F8:25:00:54,130,海户屯8S-33",
                "A0:E6:F8:25:00:55,130,海户屯8S-34",
                "A0:E6:F8:25:00:5D,130,海户屯8S-35",
                "A0:E6:F8:25:00:5C,130,海户屯8S-36",
                "A0:E6:F8:25:00:59,130,海户屯8S-37",
                "A0:E6:F8:25:00:56,130,海户屯8S-38",
                "A0:E6:F8:25:00:58,130,海户屯8S-39",
                "A0:E6:F8:25:00:57,130,海户屯8S-40",
                "A0:E6:F8:25:00:4A,131,大红门8S-41",
                "A0:E6:F8:25:01:E9,131,大红门8S-42",
                "A0:E6:F8:25:01:E8,131,大红门8S-43",
                "A0:E6:F8:25:00:4D,131,大红门8S-44",
                "A0:E6:F8:25:00:4C,131,大红门8S-45",
                "A0:E6:F8:25:00:48,131,大红门8S-46",
                "A0:E6:F8:25:00:47,131,大红门8S-47",
                "A0:E6:F8:25:00:4B,131,大红门8S-48",
                "A0:E6:F8:25:00:41,132,大红门南8S-49",
                "A0:E6:F8:25:00:3F,132,大红门南8S-50",
                "A0:E6:F8:25:00:45,132,大红门南8S-51",
                "A0:E6:F8:25:00:44,132,大红门南8S-52",
                "A0:E6:F8:25:00:3E,132,大红门南8S-53",
                "A0:E6:F8:25:00:49,132,大红门南8S-54",
                "A0:E6:F8:25:00:4F,132,大红门南8S-55",
                "A0:E6:F8:25:00:42,132,大红门南8S-56",
                "A0:E6:F8:25:01:D8,133,和义8S-57",
                "A0:E6:F8:25:00:4E,133,和义8S-58",
                "A0:E6:F8:25:00:36,133,和义8S-59",
                "A0:E6:F8:25:00:34,133,和义8S-60",
                "A0:E6:F8:25:00:37,133,和义8S-61",
                "A0:E6:F8:25:00:35,133,和义8S-62",
                "A0:E6:F8:25:00:3C,133,和义8S-63",
                "A0:E6:F8:25:00:39,133,和义8S-64",
                "A0:E6:F8:25:00:3D,134,东高地8S-65",
                "A0:E6:F8:25:00:3A,134,东高地8S-66",
                "A0:E6:F8:25:00:3B,134,东高地8S-67",
                "A0:E6:F8:25:00:38,134,东高地8S-68",
                "A0:E6:F8:25:00:77,134,东高地8S-69",
                "A0:E6:F8:25:00:73,134,东高地8S-70",
                "A0:E6:F8:25:00:69,134,东高地8S-71",
                "A0:E6:F8:25:00:5A,134,东高地8S-72",
                "A0:E6:F8:25:00:74,135,火箭万源8S-73",
                "A0:E6:F8:25:00:5B,135,火箭万源8S-74",
                "A0:E6:F8:25:00:6E,135,火箭万源8S-75",
                "A0:E6:F8:25:00:B6,135,火箭万源8S-76",
                "A0:E6:F8:25:01:ED,135,火箭万源8S-77",
                "A0:E6:F8:25:00:B8,135,火箭万源8S-78",
                "A0:E6:F8:25:00:81,135,火箭万源8S-79",
                "A0:E6:F8:25:00:BC,135,火箭万源8S-80",
                "A0:E6:F8:25:00:B7,136,五福堂8S-81",
                "A0:E6:F8:25:00:27,136,五福堂8S-82",
                "A0:E6:F8:25:00:0F,136,五福堂8S-83",
                "A0:E6:F8:25:00:8A,136,五福堂8S-84",
                "A0:E6:F8:25:00:95,136,五福堂8S-85",
                "A0:E6:F8:25:00:16,136,五福堂8S-86",
                "A0:E6:F8:25:00:91,136,五福堂8S-87",
                "A0:E6:F8:25:00:40,136,五福堂8S-88",
                "A0:E6:F8:25:01:EE,137,德茂8S-89",
                "A0:E6:F8:25:00:AA,137,德茂8S-90",
                "A0:E6:F8:25:00:A8,137,德茂8S-91",
                "A0:E6:F8:25:00:B2,137,德茂8S-92",
                "A0:E6:F8:25:00:B3,137,德茂8S-93",
                "A0:E6:F8:25:00:B5,137,德茂8S-94",
                "A0:E6:F8:25:00:AD,137,德茂8S-95",
                "A0:E6:F8:25:00:AB,137,德茂8S-96",
                "A0:E6:F8:25:00:A9,138,瀛海8S-97",
                "A0:E6:F8:25:00:B4,138,瀛海8S-98",
                "A0:E6:F8:25:00:BB,138,瀛海8S-99",
                "A0:E6:F8:25:00:B0,138,瀛海8S-100",
                "A0:E6:F8:25:00:AE,138,瀛海8S-101",
                "A0:E6:F8:25:00:B1,138,瀛海8S-102",
                "A0:E6:F8:25:00:9D,138,瀛海8S-103",
                "A0:E6:F8:25:00:9B,138,瀛海8S-104",
                ""
        };

        String ts = "2019-08-30 00:00:00";
        String ts2 = "2020-01-01 00:00:00";
        int id_start = 1044;

        // XXX XXX 记得更新 rtv_beacon_location 对应位置的绑定状态：
        // XXX XXX UPDATE `rtv_beacon_location` SET `status` = 1 WHERE id >= 65 and id <= 83;
        /**
         * UPDATE `rtv_beacon_location` SET `status` = 1 WHERE id >= 88 and id <= 103;
         * UPDATE `rtv_beacon_location` SET `status` = 1 WHERE id >= 104 and id <= 122;
         * UPDATE `rtv_beacon_location` SET `status` = 1 WHERE id >= 126 and id <= 138;
         */

        //('27', '8', '2019-01-10 00:00:00', 0, '2019-03-10 00:00:00', NULL, '2019-02-17 15:18:26', 100, 'A0:E6:F8:25:D7:91', '积水潭51');

        for (String i : data) {
            if (StringUtils.isEmpty(i)) {
                continue;
            }
            id_start++;
            String[] item = i.split(",");
            String mac = item[0];
            String loc_id = item[1];
            String name = item[2];
            sb.append("\n('" + id_start + "', '" + loc_id + "', '" + ts + "', 0, '" + ts2 + "', NULL, '" + ts + "', 100, '" + mac + "', '" + name + "'),");
        }
        sb.deleteCharAt(sb.length() - 1);
        sb.append(";");

        System.out.println(sb.toString());

    }

}


