package com.zom.factory.script.yun3;

import org.springframework.util.StringUtils;

public class NFC_INSERT {

    public static void main(String[] args) {
        generateInsertSQL();
    }

    public static void generateInsertSQL() {
        StringBuilder sb = new StringBuilder(1000);
        String sql_base = "INSERT INTO `rtv_nfc`(`nfc_id`, `nfc_name`, `update_time`, `work_status`, `corp_id`) " +
                "VALUES ";

        sb.append(sql_base);

        //
        // ('27', '8', '2019-01-10 00:00:00', 0, '2019-03-10 00:00:00', NULL, '2019-02-17 15:18:26', 100, 'A0:E6:F8:25:D7:91', '积水潭51');
        //('8986043201187962500', '1', 1, '2019-02-28 15:14:00', 0, '', NULL, 3, 0, 0),;";

        String[] data = {
                //"标识,巡检位置",
                "04:23:14:82:65:5A:81,A出入口",
                "04:17:37:82:65:5A:81,B1出入口",
                "04:87:25:82:65:5A:80,B2出入口",
                "04:B7:23:82:65:5A:80,C出入口",
                "04:29:34:82:65:5A:81,D出入口",
                "04:F7:20:82:65:5A:80,上行头端端门",
                "04:7A:1B:82:65:5A:80,上行尾端端门",
                "04:C7:34:82:65:5A:80,下行头端端门",
                "04:74:2E:82:65:5A:80,下行尾端端门",
                "04:87:1F:82:65:5A:80,站厅B端AED",
                "04:E9:11:82:65:5A:80,站厅中部AED",
                "04:38:2A:82:65:5A:81,站台中部AED",
                "04:D4:23:82:65:5A:80,客服中心",
                "04:16:20:82:65:5A:81,公共洗手间",
                "04:87:3A:82:65:5A:80,A出入口",
                "04:06:21:82:65:5A:81,B出入口",
                "04:B7:15:82:65:5A:80,C出入口",
                "04:17:39:82:65:5A:81,D出入口",
                "04:B7:24:82:65:5A:80,上行头端端门",
                "04:10:2C:82:65:5A:81,上行尾端端门",
                "04:7E:1A:82:65:5A:80,下行头端端门",
                "04:D8:10:82:65:5A:80,下行尾端端门",
                "04:6D:39:82:65:5A:80,站厅中部AED",
                "04:18:31:82:65:5A:81,站台中部AED",
                "04:F7:19:82:65:5A:80,逃生通道1",
                "04:80:18:82:65:5A:80,轨行区楼梯间",
                "04:FD:0D:82:65:5A:80,客服中心",
                "04:E6:0F:82:65:5A:80,公共洗手间",
                "04:D4:29:82:65:5A:80,A出入口",
                "04:7A:23:82:65:5A:80,B出入口",
                "04:2B:29:82:65:5A:81,C出入口",
                "04:D9:18:82:65:5A:80,D出入口",
                "04:9B:0B:82:65:5A:80,E出入口",
                "04:BB:2F:82:65:5A:80,F出入口",
                "04:CE:39:82:65:5A:80,G出入口",
                "04:8E:2E:82:65:5A:80,11号线上行头端端门",
                "04:47:2F:82:65:5A:81,11号线上行尾端端门",
                "04:CB:31:82:65:5A:80,11号线下行头端端门",
                "04:91:37:82:65:5A:80,11号线下行尾端端门",
                "04:32:1D:82:65:5A:81,站厅A端AED",
                "04:F4:17:82:65:5A:80,站厅B端AED",
                "04:BB:2B:82:65:5A:80,11号线站台中部AED",
                "04:84:2E:82:65:5A:80,逃生通道1",
                "04:AF:26:82:65:5A:80,逃生通道2",
                "04:84:35:82:65:5A:80,逃生通道3",
                "04:06:0E:82:65:5A:81,逃生通道4",
                "04:16:24:82:65:5A:81,逃生通道5",
                "04:B6:2C:82:65:5A:80,轨行区楼梯间",
                "04:8E:13:82:65:5A:80,A端客服中心",
                "04:10:23:82:65:5A:81,B端客服中心",
                "04:2B:1A:82:65:5A:81,11号线站台公共洗手间",
                "04:E0:1F:82:65:5A:80,站厅公共洗手间",
                "04:52:32:82:65:5A:81,站厅B端物业区通道门",
                "04:84:22:82:65:5A:80,A出入口",
                "04:7A:2E:82:65:5A:80,B出入口",
                "04:7B:26:82:65:5A:80,C出入口",
                "04:5C:39:82:65:5A:81,D出入口",
                "04:10:16:82:65:5A:81,E出入口",
                "04:B5:30:82:65:5A:80,上行头端端门",
                "04:CB:1D:82:65:5A:80,上行尾端端门",
                "04:8E:16:82:65:5A:80,下行头端端门",
                "04:E0:0B:82:65:5A:80,下行尾端端门",
                "04:B5:1C:82:65:5A:80,站厅中部AED",
                "04:07:1F:82:65:5A:81,站台中部AED",
                "04:7B:17:82:65:5A:80,逃生通道1",
                "04:7E:23:82:65:5A:80,逃生通道2",
                "04:6D:30:82:65:5A:80,轨行区楼梯间",
                "04:A7:12:82:65:5A:80,客服中心",
                "04:A3:3B:82:65:5A:80,公共洗手间",
                ""
        };

        String ts = "2020-06-08 00:00:00";
        int id_start = 24;


        for (String i : data) {
            if (StringUtils.isEmpty(i)) {
                continue;
            }
            //id_start++;
            String[] item = i.split(",");
            String nfc_id = item[0];
            String nfc_name = item[1];
            String wordstatus = "1";
            String corpId = "1";
            sb.append("\n('" + nfc_id + "', '" + nfc_name + "', '" + ts + "', '" + wordstatus + "', '" + corpId + "'),");
        }
        sb.deleteCharAt(sb.length() - 1);
        sb.append(";");

        System.out.println(sb.toString());

    }

}


