package com.zom.keep.tech.script.yun3;

public class USER_INSERT {

    public static void main(String[] args) {
        generateInsertSQL();
    }

    public static void generateInsertSQL() {
        StringBuilder sb = new StringBuilder(1000);
        String sql_base = "INSERT INTO `rtv_user`(`id`, `display_name`, `user_password`, `client_version`, `device`, `img_url`, `phone`, `register_date`, `last_logon_date`, `last_access_date`, `last_logon_ip`, `logon_state`, `salt`, `ts_profile`, `ts_group`, `rank`, `admin_id`, `dcg_id`, `corp_id`, `logon_name`, `priority`, `status`, `preconfig`, `default_grp`, `gps_report`, `gps_interval`, `adm_ts`, `zone_id`, `ats`, `pts`, `imei`, `lmr_uid`, `ext_did`, `extension_property`, `code`, `unit_id`, `department_id`, `original_name`, `unit_fk_id`, `department_fk_id`, `iccid`, `logon_type`, `last_update_time`) " +
                "VALUES ";
        sb.append(sql_base);

        //(65827, '雍和宫站长', 'dfeddeeadfe9', NULL, 'portable', NULL, '13700002604', '2019-02-25 09:12:52', '2019-02-25 09:12:52', NULL, NULL, 'offline', '3b2ff12d2b34bf3c', 3, 2, 0, 0, 65827, 2, 'u265827', 3, 2, 1, 0, 1, 30, 0, 1, 0, 0, NULL, 65827, NULL, NULL, NULL, '35', '59', '雍和宫站长', 35, 59, '', 0, '2019-02-25 10:04:15');";

        String[] data = {
                "8986043201187962500,112,普通手持终端,巴沟-区长",
                "8986043201187962501,112,普通手持终端,巴沟-副区",
                "8986043201187962502,154,普通手持终端,巴沟-班长",
                "8986043201187962503,154,普通手持终端,巴沟-综控1",
                "8986043201187962504,154,普通手持终端,巴沟-综控2",
                "8986043201187962505,154,应急手持终端,巴沟-站台1",
                "8986043201187962506,154,应急手持终端,巴沟-站台2",
                "8986043201187962507,153,普通手持终端,苏州街-班长",
                "8986043201187962508,153,普通手持终端,苏州街-综控1",
                "8986043201187962509,153,普通手持终端,苏州街-综控2",
                "8986043201187962510,153,应急手持终端,苏州街-站台1",
                "8986043201187962511,153,应急手持终端,苏州街-站台2",
                "8986043201187962512,152,普通手持终端,海淀黄庄-班长",
                "8986043201187962513,152,普通手持终端,海淀黄庄-综控1",
                "8986043201187962514,152,普通手持终端,海淀黄庄-综控2",
                "8986043201187962515,152,应急手持终端,海淀黄庄-站台1",
                "8986043201187962516,152,应急手持终端,海淀黄庄-站台2",
                "8986043201187962517,151,普通手持终端,知春里-班长",
                "8986043201187962518,151,普通手持终端,知春里-综控1",
                "8986043201187962519,151,普通手持终端,知春里-综控2",
                "8986043201187962520,151,应急手持终端,知春里-站台",
                "8986043201187962521,111,普通手持终端,牡丹园-区长",
                "8986043201187962522,111,普通手持终端,牡丹园-副区",
                "8986043201187962523,150,普通手持终端,知春路10#-班长",
                "8986043201187962524,150,普通手持终端,知春路10#-综控1",
                "8986043201187962525,150,普通手持终端,知春路10#-综控2",
                "8986043201187962526,150,应急手持终端,知春路10#-站台1",
                "8986043201187962527,150,应急手持终端,知春路10#-站台2",
                "8986043201187962528,149,普通手持终端,西土城-班长",
                "8986043201187962529,149,普通手持终端,西土城-综控1",
                "8986043201187962530,149,普通手持终端,西土城-综控2",
                "8986043201187962531,149,应急手持终端,西土城-站台",
                "8986043201187962532,148,普通手持终端,牡丹园-班长",
                "8986043201187962533,148,普通手持终端,牡丹园-综控1",
                "8986043201187962534,148,普通手持终端,牡丹园-综控2",
                "8986043201187962535,148,应急手持终端,牡丹园-站台",
                "8986043201187962536,147,普通手持终端,健德门-班长",
                "8986043201187962537,147,普通手持终端,健德门-综控1",
                "8986043201187962538,147,普通手持终端,健德门-综控2",
                "8986043201187962539,147,应急手持终端,健德门-站台",
                "8986043201187962540,146,普通手持终端,北土城10#-班长",
                "8986043201187962541,146,普通手持终端,北土城10#-综控1",
                "8986043201187962542,146,普通手持终端,北土城10#-综控2",
                "8986043201187962543,146,应急手持终端,北土城10#-站台",
                "8986043201187962544,109,普通手持终端,安贞门-区长",
                "8986043201187962545,109,普通手持终端,安贞门-副区",
                "8986043201187962546,145,普通手持终端,安贞门-班长",
                "8986043201187962547,145,普通手持终端,安贞门-综控1",
                "8986043201187962548,145,普通手持终端,安贞门-综控2",
                "8986043201187962549,145,应急手持终端,安贞门-站台1",
                "8986043201187962550,145,应急手持终端,安贞门-站台2",
                "8986043201187962551,144,普通手持终端,芍药居10#-班长",
                "8986043201187962552,144,普通手持终端,芍药居10#-综控1",
                "8986043201187962553,144,普通手持终端,芍药居10#-综控2",
                "8986043201187962554,144,应急手持终端,芍药居10#-站台",
                "8986043201187962555,143,普通手持终端,太阳宫-班长",
                "8986043201187962556,143,普通手持终端,太阳宫-综控1",
                "8986043201187962557,143,普通手持终端,太阳宫-综控2",
                "8986043201187962558,143,应急手持终端,太阳宫-站台",
                "8986043201187962559,142,普通手持终端,三元桥-班长",
                "8986043201187962560,142,普通手持终端,三元桥-综控1",
                "8986043201187962561,142,普通手持终端,三元桥-综控2",
                "8986043201187962562,142,应急手持终端,三元桥-站台",
                "8986043201187962563,108,普通手持终端,亮马桥-区长",
                "8986043201187962564,108,普通手持终端,亮马桥-副区",
                "8986043201187962565,141,普通手持终端,亮马桥-班长",
                "8986043201187962566,141,普通手持终端,亮马桥-综控1",
                "8986043201187962567,141,普通手持终端,亮马桥-综控2",
                "8986043201187962568,141,应急手持终端,亮马桥-站台",
                "8986043201187962569,140,普通手持终端,农业展览馆-班长",
                "8986043201187962570,140,普通手持终端,农业展览馆-综控1",
                "8986043201187962571,140,普通手持终端,农业展览馆-综控2",
                "8986043201187962572,140,应急手持终端,农业展览馆-站台",
                "8986043201187962573,139,普通手持终端,团结湖-班长",
                "8986043201187962574,139,普通手持终端,团结湖-综控1",
                "8986043201187962575,139,普通手持终端,团结湖-综控2",
                "8986043201187962576,139,应急手持终端,团结湖-站台1",
                "8986043201187962577,139,应急手持终端,团结湖-站台2",
                "8986043201187962578,138,普通手持终端,呼家楼-班长",
                "8986043201187962579,138,普通手持终端,呼家楼-综控1",
                "8986043201187962580,138,普通手持终端,呼家楼-综控2",
                "8986043201187962581,138,应急手持终端,呼家楼-站台1",
                "8986043201187962582,138,应急手持终端,呼家楼-站台2",
                "8986043201187962583,107,普通手持终端,国贸-区长",
                "8986043201187962584,107,普通手持终端,国贸-副区",
                "8986043201187962585,137,普通手持终端,金台夕照-班长",
                "8986043201187962586,137,普通手持终端,金台夕照-综控1",
                "8986043201187962587,137,普通手持终端,金台夕照-综控2",
                "8986043201187962588,137,应急手持终端,金台夕照-站台1",
                "8986043201187962589,137,应急手持终端,金台夕照-站台2",
                "8986043201187962590,136,普通手持终端,国贸-班长",
                "8986043201187962591,136,普通手持终端,国贸-综控1",
                "8986043201187962592,136,普通手持终端,国贸-综控2",
                "8986043201187962593,136,应急手持终端,国贸-站台1",
                "8986043201187962594,136,应急手持终端,国贸-站台2",
                "8986043201187962595,135,普通手持终端,双井-班长",
                "8986043201187962596,135,普通手持终端,双井-综控1",
                "8986043201187962597,135,普通手持终端,双井-综控2",
                "8986043201187962598,135,应急手持终端,双井-站台",
                "8986043201187962599,134,普通手持终端,劲松-班长",
                "8986043201187962600,134,普通手持终端,劲松-综控1",
                "8986043201187962601,134,普通手持终端,劲松-综控2",
                "8986043201187962602,134,应急手持终端,劲松-站台",
                "8986043201187962603,106,普通手持终端,成寿寺-区长",
                "8986043201187962604,106,普通手持终端,成寿寺-副区",
                "8986043201187962605,133,普通手持终端,潘家园-班长",
                "8986043201187962606,133,普通手持终端,潘家园-综控1",
                "8986043201187962607,133,普通手持终端,潘家园-综控2",
                "8986043201187962608,133,应急手持终端,潘家园-站台",
                "8986043201187962609,132,普通手持终端,十里河-班长",
                "8986043201187962610,132,普通手持终端,十里河-综控1",
                "8986043201187962611,132,普通手持终端,十里河-综控2",
                "8986043201187962612,132,应急手持终端,十里河-站台",
                "8986043201187962613,131,普通手持终端,分钟寺-班长",
                "8986043201187962614,131,普通手持终端,分钟寺-综控1",
                "8986043201187962615,131,普通手持终端,分钟寺-综控2",
                "8986043201187962616,131,应急手持终端,分钟寺-站台",
                "8986043201187962617,130,普通手持终端,成寿寺-班长",
                "8986043201187962618,130,普通手持终端,成寿寺-综控1",
                "8986043201187962619,130,普通手持终端,成寿寺-综控2",
                "8986043201187962620,130,应急手持终端,成寿寺-站台",
                "8986043201187962621,105,普通手持终端,大红门-区长",
                "8986043201187962622,105,普通手持终端,大红门-副区",
                "8986043201187962623,129,普通手持终端,石榴庄-班长",
                "8986043201187962624,129,普通手持终端,石榴庄-综控1",
                "8986043201187962625,129,普通手持终端,石榴庄-综控2",
                "8986043201187962626,129,应急手持终端,石榴庄-站台",
                "8986043201187962627,128,普通手持终端,大红门10#-班长",
                "8986043201187962628,128,普通手持终端,大红门10#-综控1",
                "8986043201187962629,128,普通手持终端,大红门10#-综控2",
                "8986043201187962630,128,应急手持终端,大红门10#-站台",
                "8986043201187962631,127,普通手持终端,角门东-班长",
                "8986043201187962632,127,普通手持终端,角门东-综控1",
                "8986043201187962633,127,普通手持终端,角门东-综控2",
                "8986043201187962634,127,应急手持终端,角门东-站台",
                "8986043201187962635,126,普通手持终端,角门西-班长",
                "8986043201187962636,126,普通手持终端,角门西-综控1",
                "8986043201187962637,126,普通手持终端,角门西-综控2",
                "8986043201187962638,126,应急手持终端,角门西-站台1",
                "8986043201187962639,126,应急手持终端,角门西-站台2",
                "8986043201187962640,104,普通手持终端,首经贸-区长",
                "8986043201187962641,104,普通手持终端,首经贸-副区",
                "8986043201187962642,125,普通手持终端,草桥-班长",
                "8986043201187962643,125,普通手持终端,草桥-综控1",
                "8986043201187962644,125,普通手持终端,草桥-综控2",
                "8986043201187962645,125,应急手持终端,草桥-站台",
                "8986043201187962646,124,普通手持终端,纪家庙-班长",
                "8986043201187962647,124,普通手持终端,纪家庙-综控1",
                "8986043201187962648,124,普通手持终端,纪家庙-综控2",
                "8986043201187962649,124,应急手持终端,纪家庙-站台",
                "8986043201187962650,123,普通手持终端,首经贸-班长",
                "8986043201187962651,123,普通手持终端,首经贸-综控1",
                "8986043201187962652,123,普通手持终端,首经贸-综控2",
                "8986043201187962653,123,应急手持终端,首经贸-站台",
                "8986043201187962654,122,普通手持终端,丰台-班长",
                "8986043201187962655,122,普通手持终端,丰台-综控1",
                "8986043201187962656,122,普通手持终端,丰台-综控2",
                "8986043201187962657,122,应急手持终端,丰台-站台",
                "8986043201187962658,121,普通手持终端,泥洼-班长",
                "8986043201187962659,121,普通手持终端,泥洼-综控1",
                "8986043201187962660,121,普通手持终端,泥洼-综控2",
                "8986043201187962661,121,应急手持终端,泥洼-站台",
                "8986043201187962662,103,普通手持终端,西局-区长",
                "8986043201187962663,103,普通手持终端,西局-副区",
                "8986043201187962664,120,普通手持终端,西局-班长",
                "8986043201187962665,120,普通手持终端,西局-综控1",
                "8986043201187962666,120,普通手持终端,西局-综控2",
                "8986043201187962667,120,应急手持终端,西局-站台",
                "8986043201187962668,119,普通手持终端,莲花桥-班长",
                "8986043201187962669,119,普通手持终端,莲花桥-综控1",
                "8986043201187962670,119,普通手持终端,莲花桥-综控2",
                "8986043201187962671,119,应急手持终端,莲花桥-站台",
                "8986043201187962672,118,普通手持终端,公主坟-班长",
                "8986043201187962673,118,普通手持终端,公主坟-综控1",
                "8986043201187962674,118,普通手持终端,公主坟-综控2",
                "8986043201187962675,118,应急手持终端,公主坟-站台1",
                "8986043201187962676,118,应急手持终端,公主坟-站台2",
                "8986043201187962677,117,普通手持终端,西钓鱼台-班长",
                "8986043201187962678,117,普通手持终端,西钓鱼台-综控1",
                "8986043201187962679,117,普通手持终端,西钓鱼台-综控2",
                "8986043201187962680,117,应急手持终端,西钓鱼台-站台",
                "8986043201187962681,102,普通手持终端,慈寿寺-区长",
                "8986043201187962682,102,普通手持终端,慈寿寺-副区",
                "8986043201187962683,116,普通手持终端,慈寿寺-班长",
                "8986043201187962684,116,普通手持终端,慈寿寺-综控1",
                "8986043201187962685,116,普通手持终端,慈寿寺-综控2",
                "8986043201187962686,116,应急手持终端,慈寿寺-站台",
                "8986043201187962687,115,普通手持终端,车道沟-班长",
                "8986043201187962688,115,普通手持终端,车道沟-综控1",
                "8986043201187962689,115,普通手持终端,车道沟-综控2",
                "8986043201187962690,115,应急手持终端,车道沟-站台",
                "8986043201187962691,114,普通手持终端,长春桥-班长",
                "8986043201187962692,114,普通手持终端,长春桥-综控1",
                "8986043201187962693,114,普通手持终端,长春桥-综控2",
                "8986043201187962694,114,应急手持终端,长椿桥-站台",
                "8986043201187962695,113,普通手持终端,火器营-班长",
                "8986043201187962696,113,普通手持终端,火器营-综控1",
                "8986043201187962697,113,普通手持终端,火器营-综控2",
                "8986043201187962698,113,应急手持终端,火器营-站台",
                "8986043201187962699,158,普通手持终端,万柳乘务-主任",
                "8986043201187962700,158,普通手持终端,万柳乘务-巴沟正线副主任",
                "8986043201187962701,158,普通手持终端,万柳乘务-宋家庄正线副主任",
                "8986043201187962702,158,普通手持终端,万柳乘务-安全副主任",
                "8986043201187962703,158,普通手持终端,万柳乘务-宋家庄后区副主任",
                "8986043201187962704,158,普通手持终端,万柳乘务-五路后区副主任",
                "8986043201187962705,158,普通手持终端,万柳乘务-万柳后区副主任",
                "8986043201187962706,158,普通手持终端,万柳乘务-巴沟轮乘1",
                "8986043201187962707,158,普通手持终端,万柳乘务-巴沟轮乘2",
                "8986043201187962708,158,普通手持终端,万柳乘务-巴沟轮乘3",
                "8986043201187962709,158,普通手持终端,万柳乘务-巴沟轮乘4",
                "8986043201187962710,158,普通手持终端,万柳乘务-宋家庄轮乘1",
                "8986043201187962711,158,普通手持终端,万柳乘务-宋家庄轮乘2",
                "8986043201187962712,158,普通手持终端,万柳乘务-宋家庄轮乘3",
                "8986043201187962713,158,普通手持终端,万柳乘务-宋家庄轮乘4",
                "8986043201187962714,159,普通手持终端,万柳维修-主任",
                "8986043201187962715,159,普通手持终端,万柳维修-万柳副主任",
                "8986043201187962716,159,普通手持终端,万柳维修-五路副主任",
                "8986043201187962717,159,普通手持终端,万柳维修-宋家庄副主任",
                "8986043201187962718,159,普通手持终端,万柳维修-正线副主任",
                "8986043201187962719,159,普通手持终端,万柳维修-生产副主任",
                "8986043201187962720,159,普通手持终端,万柳维修-万柳列检班",
                "8986043201187962721,159,普通手持终端,万柳维修-五路列检班",
                "8986043201187962722,159,普通手持终端,万柳维修-宋家庄列检班",
                "8986043201187962723,159,普通手持终端,万柳维修-宋家庄值守1",
                "8986043201187962724,159,普通手持终端,万柳维修-宋家庄值守2",
                "8986043201187962725,159,普通手持终端,万柳维修-巴沟值守1",
                "8986043201187962726,159,普通手持终端,万柳维修-巴沟值守2",
                "8986043201187962727,99,普通手持终端,宋家庄基地调控",
                "8986043201187962728,99,普通手持终端,万柳基地调控",
                "8986043201187962729,99,普通手持终端,五路基地调控",
                "8986043201187962730,99,车头手持终端,10#001列车,001",
                "8986043201187962731,99,车头手持终端,10#002列车,002",
                "8986043201187962732,99,车头手持终端,10#003列车,003",
                "8986043201187962733,99,车头手持终端,10#004列车,004",
                "8986043201187962734,99,车头手持终端,10#005列车,005",
                "8986043201187962735,99,车头手持终端,10#006列车,006",
                "8986043201187962736,99,车头手持终端,10#007列车,007",
                "8986043201187962737,99,车头手持终端,10#008列车,008",
                "8986043201187962738,99,车头手持终端,10#009列车,009",
                "8986043201187962739,99,车头手持终端,10#010列车,010",
                "8986043201187962740,99,车头手持终端,10#011列车,011",
                "8986043201187962741,99,车头手持终端,10#012列车,012",
                "8986043201187962742,99,车头手持终端,10#013列车,013",
                "8986043201187962743,99,车头手持终端,10#014列车,014",
                "8986043201187962744,99,车头手持终端,10#015列车,015",
                "8986043201187962745,99,车头手持终端,10#016列车,016",
                "8986043201187962746,99,车头手持终端,10#017列车,017",
                "8986043201187962747,99,车头手持终端,10#018列车,018",
                "8986043201187962748,99,车头手持终端,10#019列车,019",
                "8986043201187962749,99,车头手持终端,10#020列车,020",
                "8986043201187962750,99,车头手持终端,10#021列车,021",
                "8986043201187962751,99,车头手持终端,10#022列车,022",
                "8986043201187962752,99,车头手持终端,10#023列车,023",
                "8986043201187962753,99,车头手持终端,10#024列车,024",
                "8986043201187962754,99,车头手持终端,10#025列车,025",
                "8986043201187962755,99,车头手持终端,10#026列车,026",
                "8986043201187962756,99,车头手持终端,10#027列车,027",
                "8986043201187962757,99,车头手持终端,10#028列车,028",
                "8986043201187962758,99,车头手持终端,10#029列车,029",
                "8986043201187962759,99,车头手持终端,10#030列车,030",
                "8986043201187962760,99,车头手持终端,10#031列车,031",
                "8986043201187962761,99,车头手持终端,10#032列车,032",
                "8986043201187962762,99,车头手持终端,10#033列车,033",
                "8986043201187962763,99,车头手持终端,10#034列车,034",
                "8986043201187962764,99,车头手持终端,10#035列车,035",
                "8986043201187962765,99,车头手持终端,10#036列车,036",
                "8986043201187962766,99,车头手持终端,10#037列车,037",
                "8986043201187962767,99,车头手持终端,10#038列车,038",
                "8986043201187962768,99,车头手持终端,10#039列车,039",
                "8986043201187962769,99,车头手持终端,10#040列车,040",
                "8986043201187962770,99,车头手持终端,10#041列车,041",
                "8986043201187962771,99,车头手持终端,10#042列车,042",
                "8986043201187962772,99,车头手持终端,10#043列车,043",
                "8986043201187962773,99,车头手持终端,10#044列车,044",
                "8986043201187962774,99,车头手持终端,10#045列车,045",
                "8986043201187962775,99,车头手持终端,10#046列车,046",
                "8986043201187962776,99,车头手持终端,10#047列车,047",
                "8986043201187962777,99,车头手持终端,10#048列车,048",
                "8986043201187962778,99,车头手持终端,10#049列车,049",
                "8986043201187962779,99,车头手持终端,10#050列车,050",
                "8986043201187962780,99,车头手持终端,10#051列车,051",
                "8986043201187962781,99,车头手持终端,10#052列车,052",
                "8986043201187962782,99,车头手持终端,10#053列车,053",
                "8986043201187962783,99,车头手持终端,10#054列车,054",
                "8986043201187962784,99,车头手持终端,10#055列车,055",
                "8986043201187962785,99,车头手持终端,10#056列车,056",
                "8986043201187962786,99,车头手持终端,10#057列车,057",
                "8986043201187962787,99,车头手持终端,10#058列车,058",
                "8986043201187962788,99,车头手持终端,10#059列车,059",
                "8986043201187962789,99,车头手持终端,10#060列车,060",
                "8986043201187962790,99,车头手持终端,10#061列车,061",
                "8986043201187962791,99,车头手持终端,10#062列车,062",
                "8986043201187962792,99,车头手持终端,10#063列车,063",
                "8986043201187962793,99,车头手持终端,10#064列车,064",
                "8986043201187962794,99,车头手持终端,10#065列车,065",
                "8986043201187962795,99,车头手持终端,10#066列车,066",
                "8986043201187962796,99,车头手持终端,10#067列车,067",
                "8986043201187962797,99,车头手持终端,10#068列车,068",
                "8986043201187962798,99,车头手持终端,10#069列车,069",
                "8986043201187962799,99,车头手持终端,10#070列车,070",
                "8986043201187962800,99,车头手持终端,10#071列车,071",
                "8986043201187962801,99,车头手持终端,10#072列车,072",
                "8986043201187962802,99,车头手持终端,10#073列车,073",
                "8986043201187962803,99,车头手持终端,10#074列车,074",
                "8986043201187962804,99,车头手持终端,10#075列车,075",
                "8986043201187962805,99,车头手持终端,10#076列车,076",
                "8986043201187962806,99,车头手持终端,10#077列车,077",
                "8986043201187962807,99,车头手持终端,10#078列车,078",
                "8986043201187962808,99,车头手持终端,10#079列车,079",
                "8986043201187962809,99,车头手持终端,10#080列车,080",
                "8986043201187962810,99,车头手持终端,10#081列车,081",
                "8986043201187962811,99,车头手持终端,10#082列车,082",
                "8986043201187962812,99,车头手持终端,10#083列车,083",
                "8986043201187962813,99,车头手持终端,10#084列车,084",
                "8986043201187962814,99,车头手持终端,10#085列车,085",
                "8986043201187962815,99,车头手持终端,10#086列车,086",
                "8986043201187962816,99,车头手持终端,10#087列车,087",
                "8986043201187962817,99,车头手持终端,10#088列车,088",
                "8986043201187962818,99,车头手持终端,10#089列车,089",
                "8986043201187962819,99,车头手持终端,10#090列车,090",
                "8986043201187962820,99,车头手持终端,10#091列车,091",
                "8986043201187962821,99,车头手持终端,10#092列车,092",
                "8986043201187962822,99,车头手持终端,10#093列车,093",
                "8986043201187962823,99,车头手持终端,10#094列车,094",
                "8986043201187962824,99,车头手持终端,10#095列车,095",
                "8986043201187962825,99,车头手持终端,10#096列车,096",
                "8986043201187962826,99,车头手持终端,10#097列车,097",
                "8986043201187962827,99,车头手持终端,10#098列车,098",
                "8986043201187962828,99,车头手持终端,10#099列车,099",
                "8986043201187962829,99,车头手持终端,10#100列车,100",
                "8986043201187962830,99,车头手持终端,10#101列车,101",
                "8986043201187962831,99,车头手持终端,10#102列车,102",
                "8986043201187962832,99,车头手持终端,10#103列车,103",
                "8986043201187962833,99,车头手持终端,10#104列车,104",
                "8986043201187962834,99,车头手持终端,10#105列车,105",
                "8986043201187962835,99,车头手持终端,10#106列车,106",
                "8986043201187962836,99,车头手持终端,10#107列车,107",
                "8986043201187962837,99,车头手持终端,10#108列车,108",
                "8986043201187962838,99,车头手持终端,10#109列车,109",
                "8986043201187962839,99,车头手持终端,10#110列车,110",
                "8986043201187962840,99,车头手持终端,10#111列车,111",
                "8986043201187962841,99,车头手持终端,10#112列车,112",
                "8986043201187962842,99,车头手持终端,10#113列车,113",
                "8986043201187962843,99,车头手持终端,10#114列车,114",
                "8986043201187962844,99,车头手持终端,10#115列车,115",
                "8986043201187962845,99,车头手持终端,10#116列车,116",
                "8986043201187962846,99,车头手持终端,10#列车备用1",
                "8986043201187962847,99,车头手持终端,10#列车备用2",
                "8986043201187962848,99,车头手持终端,10#列车备用3",
                "8986043201187962849,99,车头手持终端,10#列车备用4",
                "8986043201187962850,99,车头手持终端,10#列车备用5",
                "8986043201187962851,99,车头手持终端,10#列车备用6",
        };

        String[] data_8_13 = {
                "8986043201187962859,173,普通手持终端,西直门13#-区长",
                "8986043201187962860,173,普通手持终端,西直门13#-副区",
                "8986043201187962861,178,普通手持终端,西直门-综控1",
                "8986043201187962862,177,普通手持终端,大钟寺-综控1",
                "8986043201187962863,176,普通手持终端,知春路13#-综控1",
                "8986043201187962864,175,普通手持终端,五道口-综控1",
                "8986043201187962865,174,普通手持终端,上地-综控1",
                "8986043201187962866,168,普通手持终端,霍营-区长",
                "8986043201187962867,168,普通手持终端,霍营-副区",
                "8986043201187962868,172,普通手持终端,龙泽-综控1",
                "8986043201187962869,171,普通手持终端,回龙观-综控1",
                "8986043201187962870,170,普通手持终端,霍营13#-综控1",
                "8986043201187962871,169,普通手持终端,立水桥-综控1",
                "8986043201187962872,173,普通手持终端,东直门-区长",
                "8986043201187962873,173,普通手持终端,东直门-副区",
                "8986043201187962874,167,普通手持终端,北苑-综控1",
                "8986043201187962875,166,普通手持终端,望京西-综控1",
                "8986043201187962876,165,普通手持终端,芍药居13#-综控1",
                "8986043201187962877,164,普通手持终端,光熙门-综控1",
                "8986043201187962878,163,普通手持终端,柳芳-综控1",
                "8986043201187962879,162,普通手持终端,东直门13#-综控1",
                "8986043201187962880,101,普通手持终端,鼓楼大街站务中心-主任",
                "8986043201187962881,101,普通手持终端,鼓楼大街站务中心-副主任",
                "8986043201187962882,101,普通手持终端,中国美术馆-综控1",
                "8986043201187962883,101,普通手持终端,南锣鼓巷-综控1",
                "8986043201187962884,101,普通手持终端,什刹海-综控1",
                "8986043201187962885,101,普通手持终端,鼓楼大街8#-综控1",
                "8986043201187962886,101,普通手持终端,安德里北街-综控1",
                "8986043201187962887,101,普通手持终端,安华桥-综控1",
                "8986043201187962888,101,普通手持终端,北土城8#-综控1",
                "8986043201187962889,101,普通手持终端,奥体中心-综控1",
                "8986043201187962890,101,普通手持终端,奥林匹克公园-综控1",
                "8986043201187962891,101,普通手持终端,回龙观东大街站务中心-主任",
                "8986043201187962892,101,普通手持终端,回龙观东大街站务中心-副主任",
                "8986043201187962893,101,普通手持终端,森林公园南门-综控1",
                "8986043201187962894,101,普通手持终端,林萃桥-综控1",
                "8986043201187962895,101,普通手持终端,永泰庄-综控1",
                "8986043201187962896,101,普通手持终端,西小口-综控1",
                "8986043201187962897,101,普通手持终端,育新-综控1",
                "8986043201187962898,101,普通手持终端,霍营8#-综控1",
                "8986043201187962899,101,普通手持终端,回龙观东大街-综控1",
                "8986043201187962900,101,普通手持终端,平西府-综控1",
                "8986043201187962901,101,普通手持终端,育知路-综控1",
                "8986043201187962902,101,普通手持终端,瀛海站务中心-主任",
                "8986043201187962903,101,普通手持终端,瀛海站务中心-副主任",
                "8986043201187962904,101,普通手持终端,珠市口-综控1",
                "8986043201187962905,101,普通手持终端,天桥-综控1",
                "8986043201187962906,101,普通手持终端,永定门外-综控1",
                "8986043201187962907,101,普通手持终端,木樨园-综控1",
                "8986043201187962908,101,普通手持终端,海户屯-综控1",
                "8986043201187962909,101,普通手持终端,大红门8#-综控1",
                "8986043201187962910,101,普通手持终端,大红门南-综控1",
                "8986043201187962911,101,普通手持终端,和义-综控1",
                "8986043201187962912,101,普通手持终端,东高地-综控1",
                "8986043201187962913,101,普通手持终端,火箭万源-综控1",
                "8986043201187962914,101,普通手持终端,五福堂-综控1",
                "8986043201187962915,101,普通手持终端,德茂-综控1",
                "8986043201187962916,101,普通手持终端,瀛海-综控1"
        };

        //String sql_base = "INSERT INTO `rtv_user`(`id`, `display_name`, `user_password`, `client_version`, `device`, `img_url`, `phone`, `register_date`,
        // `last_logon_date`, `last_access_date`, `last_logon_ip`, `logon_state`, `salt`, `ts_profile`, `ts_group`, `rank`, `admin_id`, `dcg_id`, `corp_id`,
        // `logon_name`, `priority`, `status`, `preconfig`, `default_grp`, `gps_report`, `gps_interval`, `adm_ts`, `zone_id`, `ats`, `pts`, `imei`, `lmr_uid`,
        // `ext_did`, `extension_property`, `code`, `unit_id`, `department_id`, `original_name`, `unit_fk_id`, `department_fk_id`, `iccid`, `logon_type`, `last_update_time`)

        int id_start = 66215;
        String ts = "2019-03-01 12:00:00";

        //DCG
        StringBuilder sb_dcg = new StringBuilder(1000);
        String sql_base_dcg = "INSERT INTO `rtv_group`(`id`, `group_ts`, `owner_id`, `group_name`, `create_date`, `corp_id`, `rank`, `dcg`, `preconfig`, `status`, `zone_id`, `console_dtg`, `admin_id`, `ext_tgid`, `parent_type`, `parent_id`, `priority`, `timer`, `type`) VALUES ";
        sb_dcg.append(sql_base_dcg);

        //rtv_user_role_mapping
        StringBuilder sb_ur = new StringBuilder(1000);
        String sql_base_ur = "INSERT INTO `rtv_user_role_mapping`(`role_id`, `user_id`) VALUES ";
        sb_ur.append(sql_base_ur);
        // XXX 先检查rtv_unit_role, unit_id 和 role_id是不是完全一致的，如果是一致的就简单替换为unit_id就行


        //rtv_user_extension
        StringBuilder sb_ext = new StringBuilder(1000);
        String sql_base_ext = "INSERT INTO `rtv_user_extension`(`uid`, `ext_did`, `cer_id`, `fixed_phone`, `ext1`, `ext2`, `ext3`, `ext4`, `ext5`, `ext6`, `ext_json`, `last_update_time`, `ptype`, `reserve_tel`, `duty`, `ordernum`, `short_phone`, `corp_id`, `state`, `department_id`, `unit_id`, `name`, `code`, `tel_number`) VALUES ";
        sb_ext.append(sql_base_ext);

        //update rtv_iccid_table
        StringBuilder sb_up_iccid = new StringBuilder(1000);

        //rtv_version_user_map
        StringBuilder sb_vu = new StringBuilder(1000);
        String sql_base_vu = "INSERT INTO `rtv_version_user_map`(`uid`, `device_type`, `cur_vid`, `plan_vid`, `force`, `plan_time`, `up_time`, `login_time`) VALUES ";
        sb_vu.append(sql_base_vu);

        data = data_8_13; // XXX XXX 导入 8，13号线
        for (String i : data) {
            id_start++;
            String[] item = i.split(",");
            int size = item.length;
            String iccid = item[0];
            String dept = item[1];
            String type = item[2];
            String name = item[3];
            if (type.equals("普通手持终端")) {
                type = "portable";
            } else if (type.equals("车载固定终端")) {
                type = "mobile";
            } else if (type.equals("车头手持终端")) {
                type = "metro_portable";
            } else if (type.equals("应急手持终端")) {
                type = "emergency_portable";
            }
            String ext = "NULL";
            if (size == 5) {
                String line_num = item[4];
                ext = "'{\"metroNum\":\"" + line_num + "\"}'";
            }

            sb.append("\n(" + id_start + ", '" + name + "', 'dfeddeeadfe9', NULL, '" + type + "', NULL, '', '" + ts + "', '" + ts + "', NULL, NULL, 'offline', '3b2ff12d2b34bf3c', 1, 1, 0, 0, " + id_start + ", 1, 'u1" + id_start + "', 3, 1, 1, 0, 1, 30, 0, 1, 0, 0, NULL, " + id_start + ", NULL, " + ext + ", NULL, '1', '" + dept + "', '" + name + "', 1, " + dept + ", '" + iccid + "', 1, '" + ts + "'),");
            sb_dcg.append("\n(" + id_start + ", 1, " + id_start + ", 'temp', '" + ts + "', 1, 0, 1, 1, 1, 1, 0, NULL, '', 1, NULL, 3, NULL, 0),");
            sb_ur.append("\n(" + dept + ", " + id_start + "),");
            sb_ext.append("\n(" + id_start + ", 'itrunk_" + id_start + "', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '" + ts + "', NULL, NULL, NULL, NULL, NULL, 1, 1, '" + dept + "', '1', '" + name + "', NULL, NULL),");
            sb_up_iccid.append("\nUPDATE `rtv_iccid_table` SET `uid` = " + id_start + ", `display_name` = '" + name + "', `status` = 1 WHERE `iccid` = '" + iccid + "';");

            sb_vu.append("\n(" + id_start + ", NULL, NULL, NULL, 0, NULL, NULL, NULL),");

        }
        sb.deleteCharAt(sb.length() - 1);
        sb.append(";");
        System.out.println(sb.toString());

        sb_dcg.deleteCharAt(sb_dcg.length() - 1);
        sb_dcg.append(";");
        System.out.println(sb_dcg.toString());

        sb_ur.deleteCharAt(sb_ur.length() - 1);
        sb_ur.append(";");
        System.out.println(sb_ur.toString());

        sb_ext.deleteCharAt(sb_ext.length() - 1);
        sb_ext.append(";");
        System.out.println(sb_ext.toString());

        System.out.println(sb_up_iccid.toString());

        sb_vu.deleteCharAt(sb_vu.length() - 1);
        sb_vu.append(";");
        System.out.println(sb_vu.toString());


        // 需要更新用户的unit_id, unit_fk_id, department_id, department_fk_id
        // 新增用户需要新增的表：group(dcg)， rtv_user_role，加入部门默认组， add_user_ext，更新zone_id_dessign的id
        id_start++;
        String zone_id_sql = "UPDATE `zone_id_assign` SET `cur_uid` = " + id_start + " WHERE `id` = 1;";
        System.out.println(zone_id_sql);

        //UPDATE `rtvitrunk`.`rtv_corp_ts` SET `corpid` = 1, `profile` = 639, `group` = 670, `rule` = 77, `params` = 78, `admin` = 149, `unit` = 183 WHERE `id` = 1;

        String corp_ts_sql = "UPDATE `rtv_corp_ts` SET `profile`=`profile`+1,`group`=`group`+1,`rule`=`rule`+1,`params`=`params`+1,`admin`=`admin`+1,`unit`=`unit`+1 WHERE `corpid` = 1;";
        System.out.println(corp_ts_sql);

        //UPDATE `rtv_iccid_table` i LEFT JOIN rtv_user u on u.iccid = i.iccid SET i.`uid` = u.id, i.`display_name` = u.display_name WHERE u.iccid is not null and u.iccid != '' and u.logon_type = 1;


    }

}


        